Show / Hide Table of Contents
Class SectionStiffnesses
Section stiffnesses
Inheritance
System.Object
SectionStiffnesses
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public class SectionStiffnesses
Properties
Improve this Doc   View Source
Alfa
rotation around x-axis
Declaration
public double Alfa { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EAx
axial stiffness
Declaration
public double EAx { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EccX
eccentricity in x-direction
Declaration
public double EccX { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EccY
eccentricity in y-direction
Declaration
public double EccY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EccZ
eccentricity in y-direction
Declaration
public double EccZ { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EDyz
product moment stiffness
Declaration
public double EDyz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EIy
bending stiffness
Declaration
public double EIy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EIz
bending stiffness
Declaration
public double EIz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GAy
shear stiffness
Declaration
public double GAy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GAz
shear stiffness
Declaration
public double GAz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GIx
torsion stiffness
Declaration
public double GIx { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source